adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.h
/* ========================================= Start of section using anonymous unions ========================================= */

#include "compiler_abstraction.h"

#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Unsupported compiler type
#endif

/* =========================================================================================================================== */
/* ================                                  Peripheral Address Map                                  ================ */
/* =========================================================================================================================== */

#define NRF_SYSCTRL_OICR_BASE             0x2F840000UL
#define NRF_SYSCTRL_L2CACHEDATA_BASE      0x3F640000UL
#define NRF_SYSCTRL_L2CACHEINFO_BASE      0x3F680000UL
#define NRF_SYSCTRL_SHA3CORE_BASE         0x5F089000UL
#define NRF_SYSCTRL_HSFLL200_BASE         0xBF004000UL
#define NRF_SYSCTRL_LRCCONF200_BASE       0xBF005000UL
#define NRF_SYSCTRL_PCGCM200_BASE         0xBF006000UL
#define NRF_SYSCTRL_PCGCS200_BASE         0xBF011000UL
#define NRF_SYSCTRL_LRCCONF210_BASE       0xBF012000UL
#define NRF_SYSCTRL_PCGCM210_BASE         0xBF013000UL
#define NRF_SYSCTRL_VPRCLIC_BASE          0xF0000000UL
#define NRF_SYSCTRL_L2CACHE_BASE          0x5F082000UL
#define NRF_SYSCTRL_RAMC110_BASE          0x5F083000UL
#define NRF_SYSCTRL_RAMC111_BASE          0x5F084000UL
#define NRF_SYSCTRL_SHA3_BASE             0x5F088000UL
#define NRF_SYSCTRL_PCGCS110_BASE         0x5F08E000UL
#define NRF_SYSCTRL_PCGCM110_BASE         0x5F08F000UL
#define NRF_SYSCTRL_EXMEE_BASE            0x5F094000UL
#define NRF_SYSCTRL_MVDMA110_BASE         0x5F097000UL
#define NRF_SYSCTRL_PPIB110_BASE          0x5F098000UL
#define NRF_SYSCTRL_RAMC120_BASE          0x5F8C3000UL
#define NRF_SYSCTRL_RAMC121_BASE          0x5F8C4000UL
#define NRF_SYSCTRL_ROMC_BASE             0x5F8C6000UL
#define NRF_SYSCTRL_MEMCONF120_BASE       0x5F8C7000UL
#define NRF_SYSCTRL_HSFLL121_BASE         0x5F8CC000UL
#define NRF_SYSCTRL_HSFLL120_BASE         0x5F8CD000UL
#define NRF_SYSCTRL_LRCCONF120_BASE       0x5F8CE000UL
#define NRF_SYSCTRL_RESETINFO120_BASE     0x5F8CE000UL
#define NRF_SYSCTRL_PCGCM120_BASE         0x5F8CF000UL
#define NRF_SYSCTRL_PCGCS120_BASE         0x5F8EA000UL
#define NRF_SYSCTRL_PCGCS121_BASE         0x5F8EB000UL
#define NRF_SYSCTRL_PCGCS122_BASE         0x5F8EC000UL
#define NRF_SYSCTRL_PCGCM121_BASE         0x5F8ED000UL
#define NRF_SYSCTRL_PPIB120_BASE          0x5F8EE000UL
#define NRF_SYSCTRL_PPIB121_BASE          0x5F8EF000UL
#define NRF_SYSCTRL_RAMC130_BASE          0x5F903000UL
#define NRF_SYSCTRL_RAMC131_BASE          0x5F904000UL
#define NRF_SYSCTRL_MEMCONF130_BASE       0x5F905000UL
#define NRF_SYSCTRL_PCGCS130_BASE         0x5F90E000UL
#define NRF_SYSCTRL_PPIB130_BASE          0x5F925000UL
#define NRF_SYSCTRL_PPIB131_BASE          0x5F926000UL
#define NRF_SYSCTRL_WDT130_BASE           0x5F92A000UL
#define NRF_SYSCTRL_PCGCS131_BASE         0x5F93C000UL
#define NRF_SYSCTRL_PCGCM130_BASE         0x5F93D000UL
#define NRF_SYSCTRL_LRCCONF130_BASE       0x5F93E000UL
#define NRF_SYSCTRL_RESETINFO130_BASE     0x5F93E000UL
#define NRF_SYSCTRL_PCGCM131_BASE         0x5F93F000UL
#define NRF_SYSCTRL_GRCCONF_BASE          0x5F940000UL
#define NRF_SYSCTRL_PCRM_BASE             0x5F943000UL
#define NRF_SYSCTRL_PCGCS132_BASE         0x5F94E000UL
#define NRF_SYSCTRL_PCGCM132_BASE         0x5F94F000UL
#define NRF_SYSCTRL_CLOCK_BASE            0x5F950000UL
#define NRF_SYSCTRL_LFRC_BASE             0x5F951000UL
#define NRF_SYSCTRL_LFLPRC_BASE           0x5F952000UL
#define NRF_SYSCTRL_LFXO_BASE             0x5F953000UL
#define NRF_SYSCTRL_FLL16M_BASE           0x5F954000UL
#define NRF_SYSCTRL_HFXO_BASE             0x5F955000UL
#define NRF_SYSCTRL_CLKMON_BASE           0x5F956000UL
#define NRF_SYSCTRL_AUDIOPLL_BASE         0x5F957000UL
#define NRF_SYSCTRL_USBHSPLL_BASE         0x5F958000UL
#define NRF_SYSCTRL_POWER_BASE            0x5F960000UL
#define NRF_SYSCTRL_VREGMAIN_BASE         0x5F961000UL
#define NRF_SYSCTRL_VREGAO1V8_BASE        0x5F962000UL
#define NRF_SYSCTRL_VREG1V0_BASE          0x5F963000UL
#define NRF_SYSCTRL_VREGAO0V8_BASE        0x5F964000UL
#define NRF_SYSCTRL_VREGVS0V8_BASE        0x5F965000UL
#define NRF_SYSCTRL_VREGSU_BASE           0x5F966000UL
#define NRF_SYSCTRL_VREGUSB_BASE          0x5F967000UL
#define NRF_SYSCTRL_AUDIOPLLPM_BASE       0x5F968000UL
#define NRF_SYSCTRL_VREGMRAM130_BASE      0x5F969000UL
#define NRF_SYSCTRL_VREGMRAM131_BASE      0x5F96A000UL
#define NRF_SYSCTRL_OSCRFR_BASE           0x5F96B000UL
#define NRF_SYSCTRL_SWEXT130_BASE         0x5F96C000UL
#define NRF_SYSCTRL_MBIAS_BASE            0x5F96D000UL
#define NRF_SYSCTRL_VDETAO1V8_BASE        0x5F970000UL
#define NRF_SYSCTRL_VDETAO0V8_BASE        0x5F971000UL
#define NRF_SYSCTRL_VDETVS0V8_BASE        0x5F972000UL
#define NRF_SYSCTRL_VDETIO_BASE           0x5F974000UL
#define NRF_SYSCTRL_VDETAO5V0_BASE        0x5F975000UL
#define NRF_SYSCTRL_VDET1V0_BASE          0x5F976000UL
#define NRF_SYSCTRL_VDETPOF5V0_BASE       0x5F979000UL
#define NRF_SYSCTRL_PPIB132_BASE          0x5F98D000UL
#define NRF_SYSCTRL_PCGCS133_BASE         0x5F98E000UL
#define NRF_SYSCTRL_PCGCM133_BASE         0x5F98F000UL
#define NRF_SYSCTRL_PPIB133_BASE          0x5F99D000UL
#define NRF_SYSCTRL_PCGCS134_BASE         0x5F99E000UL
#define NRF_SYSCTRL_PCGCM134_BASE         0x5F99F000UL
#define NRF_SYSCTRL_PPIB134_BASE          0x5F9AD000UL
#define NRF_SYSCTRL_PCGCS135_BASE         0x5F9AE000UL
#define NRF_SYSCTRL_PCGCM135_BASE         0x5F9AF000UL
#define NRF_SYSCTRL_PPIB135_BASE          0x5F9BD000UL
#define NRF_SYSCTRL_PCGCS136_BASE         0x5F9BE000UL
#define NRF_SYSCTRL_PCGCM136_BASE         0x5F9BF000UL
#define NRF_SYSCTRL_PPIB136_BASE          0x5F9CD000UL
#define NRF_SYSCTRL_PCGCS137_BASE         0x5F9CE000UL
#define NRF_SYSCTRL_PCGCM137_BASE         0x5F9CF000UL
#define NRF_SYSCTRL_PPIB137_BASE          0x5F9DD000UL
#define NRF_SYSCTRL_PCGCS138_BASE         0x5F9DE000UL
#define NRF_SYSCTRL_PCGCM138_BASE         0x5F9DF000UL

/* =========================================================================================================================== */
/* ================                                  Peripheral Declaration                                  ================ */
/* =========================================================================================================================== */

#define NRF_SYSCTRL_OICR                  ((NRF_OICR_Type*)                     NRF_SYSCTRL_OICR_BASE)
#define NRF_SYSCTRL_L2CACHEDATA           ((NRF_L2CACHEDATA_Type*)              NRF_SYSCTRL_L2CACHEDATA_BASE)
#define NRF_SYSCTRL_L2CACHEINFO           ((NRF_L2CACHEINFO_Type*)              NRF_SYSCTRL_L2CACHEINFO_BASE)
#define NRF_SYSCTRL_SHA3CORE              ((NRF_SHA3CORE_Type*)                 NRF_SYSCTRL_SHA3CORE_BASE)
#define NRF_SYSCTRL_HSFLL200              ((NRF_HSFLL_Type*)                    NRF_SYSCTRL_HSFLL200_BASE)
#define NRF_SYSCTRL_LRCCONF200            ((NRF_LRCCONF_Type*)                  NRF_SYSCTRL_LRCCONF200_BASE)
#define NRF_SYSCTRL_PCGCM200              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM200_BASE)
#define NRF_SYSCTRL_PCGCS200              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS200_BASE)
#define NRF_SYSCTRL_LRCCONF210            ((NRF_LRCCONF_Type*)                  NRF_SYSCTRL_LRCCONF210_BASE)
#define NRF_SYSCTRL_PCGCM210              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM210_BASE)
#define NRF_SYSCTRL_VPRCLIC               ((NRF_CLIC_Type*)                     NRF_SYSCTRL_VPRCLIC_BASE)
#define NRF_SYSCTRL_L2CACHE               ((NRF_CACHE_Type*)                    NRF_SYSCTRL_L2CACHE_BASE)
#define NRF_SYSCTRL_RAMC110               ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC110_BASE)
#define NRF_SYSCTRL_RAMC111               ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC111_BASE)
#define NRF_SYSCTRL_SHA3                  ((NRF_SHA3_Type*)                     NRF_SYSCTRL_SHA3_BASE)
#define NRF_SYSCTRL_PCGCS110              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS110_BASE)
#define NRF_SYSCTRL_PCGCM110              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM110_BASE)
#define NRF_SYSCTRL_EXMEE                 ((NRF_EXMEE_Type*)                    NRF_SYSCTRL_EXMEE_BASE)
#define NRF_SYSCTRL_MVDMA110              ((NRF_MVDMA_Type*)                    NRF_SYSCTRL_MVDMA110_BASE)
#define NRF_SYSCTRL_PPIB110               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB110_BASE)
#define NRF_SYSCTRL_RAMC120               ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC120_BASE)
#define NRF_SYSCTRL_RAMC121               ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC121_BASE)
#define NRF_SYSCTRL_ROMC                  ((NRF_ROMC_Type*)                     NRF_SYSCTRL_ROMC_BASE)
#define NRF_SYSCTRL_MEMCONF120            ((NRF_MEMCONF_Type*)                  NRF_SYSCTRL_MEMCONF120_BASE)
#define NRF_SYSCTRL_HSFLL121              ((NRF_HSFLL_Type*)                    NRF_SYSCTRL_HSFLL121_BASE)
#define NRF_SYSCTRL_HSFLL120              ((NRF_HSFLL_Type*)                    NRF_SYSCTRL_HSFLL120_BASE)
#define NRF_SYSCTRL_LRCCONF120            ((NRF_LRCCONF_Type*)                  NRF_SYSCTRL_LRCCONF120_BASE)
#define NRF_SYSCTRL_RESETINFO120          ((NRF_RESETINFO_Type*)                NRF_SYSCTRL_RESETINFO120_BASE)
#define NRF_SYSCTRL_PCGCM120              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM120_BASE)
#define NRF_SYSCTRL_PCGCS120              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS120_BASE)
#define NRF_SYSCTRL_PCGCS121              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS121_BASE)
#define NRF_SYSCTRL_PCGCS122              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS122_BASE)
#define NRF_SYSCTRL_PCGCM121              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM121_BASE)
#define NRF_SYSCTRL_PPIB120               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB120_BASE)
#define NRF_SYSCTRL_PPIB121               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB121_BASE)
#define NRF_SYSCTRL_RAMC130               ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC130_BASE)
#define NRF_SYSCTRL_RAMC131               ((NRF_RAMC_Type*)                     NRF_SYSCTRL_RAMC131_BASE)
#define NRF_SYSCTRL_MEMCONF130            ((NRF_MEMCONF_Type*)                  NRF_SYSCTRL_MEMCONF130_BASE)
#define NRF_SYSCTRL_PCGCS130              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS130_BASE)
#define NRF_SYSCTRL_PPIB130               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB130_BASE)
#define NRF_SYSCTRL_PPIB131               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB131_BASE)
#define NRF_SYSCTRL_WDT130                ((NRF_WDT_Type*)                      NRF_SYSCTRL_WDT130_BASE)
#define NRF_SYSCTRL_PCGCS131              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS131_BASE)
#define NRF_SYSCTRL_PCGCM130              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM130_BASE)
#define NRF_SYSCTRL_LRCCONF130            ((NRF_LRCCONF_Type*)                  NRF_SYSCTRL_LRCCONF130_BASE)
#define NRF_SYSCTRL_RESETINFO130          ((NRF_RESETINFO_Type*)                NRF_SYSCTRL_RESETINFO130_BASE)
#define NRF_SYSCTRL_PCGCM131              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM131_BASE)
#define NRF_SYSCTRL_GRCCONF               ((NRF_GRCCONF_Type*)                  NRF_SYSCTRL_GRCCONF_BASE)
#define NRF_SYSCTRL_PCRM                  ((NRF_PCRM_Type*)                     NRF_SYSCTRL_PCRM_BASE)
#define NRF_SYSCTRL_PCGCS132              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS132_BASE)
#define NRF_SYSCTRL_PCGCM132              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM132_BASE)
#define NRF_SYSCTRL_CLOCK                 ((NRF_CLOCK_Type*)                    NRF_SYSCTRL_CLOCK_BASE)
#define NRF_SYSCTRL_LFRC                  ((NRF_LFRC_Type*)                     NRF_SYSCTRL_LFRC_BASE)
#define NRF_SYSCTRL_LFLPRC                ((NRF_LFLPRC_Type*)                   NRF_SYSCTRL_LFLPRC_BASE)
#define NRF_SYSCTRL_LFXO                  ((NRF_LFXO_Type*)                     NRF_SYSCTRL_LFXO_BASE)
#define NRF_SYSCTRL_FLL16M                ((NRF_FLL16M_Type*)                   NRF_SYSCTRL_FLL16M_BASE)
#define NRF_SYSCTRL_HFXO                  ((NRF_HFXO_Type*)                     NRF_SYSCTRL_HFXO_BASE)
#define NRF_SYSCTRL_CLKMON                ((NRF_CLKMON_Type*)                   NRF_SYSCTRL_CLKMON_BASE)
#define NRF_SYSCTRL_AUDIOPLL              ((NRF_AUXPLL_Type*)                   NRF_SYSCTRL_AUDIOPLL_BASE)
#define NRF_SYSCTRL_USBHSPLL              ((NRF_AUXPLL_Type*)                   NRF_SYSCTRL_USBHSPLL_BASE)
#define NRF_SYSCTRL_POWER                 ((NRF_POWER_Type*)                    NRF_SYSCTRL_POWER_BASE)
#define NRF_SYSCTRL_VREGMAIN              ((NRF_VREGMAIN_Type*)                 NRF_SYSCTRL_VREGMAIN_BASE)
#define NRF_SYSCTRL_VREGAO1V8             ((NRF_VREGAO1V8_Type*)                NRF_SYSCTRL_VREGAO1V8_BASE)
#define NRF_SYSCTRL_VREG1V0               ((NRF_VREG1V0_Type*)                  NRF_SYSCTRL_VREG1V0_BASE)
#define NRF_SYSCTRL_VREGAO0V8             ((NRF_VREGAO0V8_Type*)                NRF_SYSCTRL_VREGAO0V8_BASE)
#define NRF_SYSCTRL_VREGVS0V8             ((NRF_VREGVS0V8_Type*)                NRF_SYSCTRL_VREGVS0V8_BASE)
#define NRF_SYSCTRL_VREGSU                ((NRF_VREGSU_Type*)                   NRF_SYSCTRL_VREGSU_BASE)
#define NRF_SYSCTRL_VREGUSB               ((NRF_VREGUSB_Type*)                  NRF_SYSCTRL_VREGUSB_BASE)
#define NRF_SYSCTRL_AUDIOPLLPM            ((NRF_AUXPM_Type*)                    NRF_SYSCTRL_AUDIOPLLPM_BASE)
#define NRF_SYSCTRL_VREGMRAM130           ((NRF_VREGMRAM_Type*)                 NRF_SYSCTRL_VREGMRAM130_BASE)
#define NRF_SYSCTRL_VREGMRAM131           ((NRF_VREGMRAM_Type*)                 NRF_SYSCTRL_VREGMRAM131_BASE)
#define NRF_SYSCTRL_OSCRFR                ((NRF_OSCRFR_Type*)                   NRF_SYSCTRL_OSCRFR_BASE)
#define NRF_SYSCTRL_SWEXT130              ((NRF_SWEXT_Type*)                    NRF_SYSCTRL_SWEXT130_BASE)
#define NRF_SYSCTRL_MBIAS                 ((NRF_MBIAS_Type*)                    NRF_SYSCTRL_MBIAS_BASE)
#define NRF_SYSCTRL_VDETAO1V8             ((NRF_VDETAO1V8_Type*)                NRF_SYSCTRL_VDETAO1V8_BASE)
#define NRF_SYSCTRL_VDETAO0V8             ((NRF_VDETAO0V8_Type*)                NRF_SYSCTRL_VDETAO0V8_BASE)
#define NRF_SYSCTRL_VDETVS0V8             ((NRF_VDETVS0V8_Type*)                NRF_SYSCTRL_VDETVS0V8_BASE)
#define NRF_SYSCTRL_VDETIO                ((NRF_VDETIO_Type*)                   NRF_SYSCTRL_VDETIO_BASE)
#define NRF_SYSCTRL_VDETAO5V0             ((NRF_VDETAO5V0_Type*)                NRF_SYSCTRL_VDETAO5V0_BASE)
#define NRF_SYSCTRL_VDET1V0               ((NRF_VDET1V0_Type*)                  NRF_SYSCTRL_VDET1V0_BASE)
#define NRF_SYSCTRL_VDETPOF5V0            ((NRF_VDETPOF5V0_Type*)               NRF_SYSCTRL_VDETPOF5V0_BASE)
#define NRF_SYSCTRL_PPIB132               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB132_BASE)
#define NRF_SYSCTRL_PCGCS133              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS133_BASE)
#define NRF_SYSCTRL_PCGCM133              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM133_BASE)
#define NRF_SYSCTRL_PPIB133               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB133_BASE)
#define NRF_SYSCTRL_PCGCS134              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS134_BASE)
#define NRF_SYSCTRL_PCGCM134              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM134_BASE)
#define NRF_SYSCTRL_PPIB134               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB134_BASE)
#define NRF_SYSCTRL_PCGCS135              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS135_BASE)
#define NRF_SYSCTRL_PCGCM135              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM135_BASE)
#define NRF_SYSCTRL_PPIB135               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB135_BASE)
#define NRF_SYSCTRL_PCGCS136              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS136_BASE)
#define NRF_SYSCTRL_PCGCM136              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM136_BASE)
#define NRF_SYSCTRL_PPIB136               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB136_BASE)
#define NRF_SYSCTRL_PCGCS137              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS137_BASE)
#define NRF_SYSCTRL_PCGCM137              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM137_BASE)
#define NRF_SYSCTRL_PPIB137               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB137_BASE)
#define NRF_SYSCTRL_PCGCS138              ((NRF_PCGCSLAVE_Type*)                NRF_SYSCTRL_PCGCS138_BASE)
#define NRF_SYSCTRL_PCGCM138              ((NRF_PCGCMASTER_Type*)               NRF_SYSCTRL_PCGCM138_BASE)

/* =========================================================================================================================== */
/* ================                                  Local Domain Remapping                                  ================ */
/* =========================================================================================================================== */

